#编程体现了一种抽象交互关系，自动化执行的思维模式。计算思维：是区别于逻辑思维和实证思维的第三种思维方式，能够促进人类思考、增进观察力和深化对交互关系的理解
#X//Y ,整数除；X%Y,余数；X**Y,幂运算或开方运算；round(),取保留位;abs(x),绝对值;divmod(x,y),商余操作；
#字符串有正向递增序号（从0开始）和返向从（-1开始)递减序号两种表达方式。
#字符串切片操作<字符串>[M:N],M缺失表示至开头，N缺失表示至结尾。[M:N:K]K为步长；[::-1]将字符串反向
#字符串操作：X+Y,连接两个字符串；n*X或X*n,复制n次字符串X；X in S,如果X是S的子串，返回True
#字符串处理函数：len(x);str(),转换成字符串；eval()从字符串转换成其他数据类型；ord()返回对应字符的编码值，chr()返回对应编码的字符
#字符串常用方法：lower(),upper();split(sep=None),返回一个列表，根据sep被分割的部分组成；count(sub),返回子串sub出现的次数；replace(old,new),字符替换；
#字符串常用方法：center(width[,fillchar]),根据宽度句中；strip(chars),去掉左右侧chars中列出的字符；join(iter),在iter变量除最后元素外每个元素后增加一个",",主要用于字符串分割
#字符串格式化：.format(),{}为槽，:<填充><对齐>（<>^）<宽度><,千分位><.精度>   ex "
#转意符\b,回退；\n换行；\r回车

#程序逻辑异常处理：try   except   else    finally
